about.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://plajjan.github.io/rss.xml"
      title="RSS feed for https://plajjan.github.io/"/>
<title>About</title>
<meta name="author" content="Kristian Larsson">
<meta name="referrer" content="no-referrer">
<link href= "css/style.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico"></head>
<body>
<div id="preamble" class="status">
<div class='header'>
  <a href='/'>Network Automation ramblings by Kristian Larsson</a>
</div>
<nav style='float: right; display: block;'>
<a href='/'>Blog</a>
<a href='/tools.html'>Tools</a>
<a href='/about.html'>About</a>
</nav></div>
<div id="content">
<div class="post-date">25 Jul 2019</div><h1 class="post-title"><a href="about.html">About</a></h1>


<div id="outline-container-org5ca576f" class="outline-2">
<h2 id="org5ca576f">Kristian Larsson</h2>
<div class="outline-text-2" id="text-org5ca576f">
<p>
I'm a network kind of guy doing network kind of things.
</p>

<p>
Currently working for Deutsche Telekom / TeraStream with network architecture and automation thereof.
</p>

<p>
I am the primary author of <a href="https://github.com/SpriteLink/NIPAP">NIPAP</a>, a fast, flexible and powerful IPAM with native support for VRFs and IPv6.
</p>

<p>
<a href="https://github.com/plajjan/vrnetlab">vrnetlab</a> is a system I put together to run virtual routers using docker containers for convenient lab / CI.
</p>

<p>
When I'm not coding for work I like building on home automation stuff. I wrote a serial binding for OpenHAB to talk to my Benq projector.
</p>

<p>
Go see my <a href="https://github.com/plajjan/">github</a> page for more up to date info on what I might be working on.
</p>
</div>

<div id="outline-container-orgcab1d37" class="outline-3">
<h3 id="orgcab1d37">Contact me</h3>
<div class="outline-text-3" id="text-orgcab1d37">
<p>
Reach me on IRC, kll on ircnet/freenode, or <a href="https://twitter.com/plajjan">Twitter</a>.
</p>

<p>
Also <a href="mailto:kristian@spritelink.net">kristian@spritelink.net</a>.
</p>
</div>
</div>
</div>
<div class="taglist"><a href="tags.html">Tags</a>: <a href="tag-nso,.html">NSO,</a> <a href="tag-ncs,.html">NCS,</a> <a href="tag-network.html">network</a> <a href="tag-automation.html">automation</a> </div></div>
<div id="postamble" class="status"><br/><div id="archive">
  <a href="/archive.html">Other posts</a>
</div></div>
</body>
</html>
